# # 导入Geo包，注意1.x版本的导入跟0.x版本的导入差别
# from pyecharts.charts import Geo
# # 导入配置项
# from pyecharts import options as opts
# # ChartType：图标类型，SymbolType：标记点类型
# from pyecharts.globals import ChartType, SymbolType
#
# geo = Geo()
#
# # 地图类型，世界地图可换为world
# geo.add_schema(maptype="广西")
# # 添加数据点
# geo.add("",
#         [
#          ('南宁市', 450100), ('柳州市', 450200), ('桂林市', 450300), ('梧州市', 450400), ('北海市', 450500), ('防城港市', 450600), ('钦州市', 450700),
#          ('贵港市', 450800), ('玉林市', 450900), ('百色市', 451000), ('贺州市', 451100), ('河池市', 451200), ('来宾市', 451300), ('崇左市', 451400)],
#         type_=ChartType.EFFECT_SCATTER)
# # 添加流向，type_设置为LINES，涟漪配置为箭头，提供的标记类型包括 'circle', 'rect', 'roundRect', 'triangle',
# # 'diamond', 'pin', 'arrow', 'none'
# geo.add("geo-lines",
#         [
#          ('南宁市', '钦州市'), ('柳州市', '钦州市'), ('桂林市', '钦州市'), ('梧州市', '钦州市'), ('北海市', '钦州市'), ('防城港市', '钦州市'),
#          ('钦州市', '钦州市'),
#          ('贵港市', '钦州市'), ('玉林市', '钦州市'), ('百色市', '钦州市'), ('贺州市', '钦州市'), ('河池市', '钦州市'), ('来宾市', '钦州市'),
#          ('崇左市', '钦州市')
#          ],
#         type_=ChartType.LINES,
#         effect_opts=opts.EffectOpts(symbol=SymbolType.ARROW, symbol_size=5, color="yellow"),
#         linestyle_opts=opts.LineStyleOpts(curve=0.2),
#         is_large=True)
# # 不显示标签
# geo.set_series_opts(label_opts=opts.LabelOpts(is_show=False))
# # 设置图标标题，visualmap_opts=opts.VisualMapOpts()为左下角的视觉映射配置项
# geo.set_global_opts(visualmap_opts=opts.VisualMapOpts(), title_opts=opts.TitleOpts(title="广西地市迁徙数据"))
# # 直接在notebook里显示图表
# geo.render_notebook()
# # 生成html文件，可传入位置参数
# geo.render("gx.html")
list = [
	[('南宁市', '南宁市'), ('柳州市', '南宁市'), ('桂林市', '南宁市'), ('梧州市', '南宁市'), ('北海市', '南宁市'), ('防城港市', '南宁市'), ('钦州市', '南宁市'),
	 ('贵港市', '南宁市'), ('玉林市', '南宁市'), ('百色市', '南宁市'), ('贺州市', '南宁市'), ('河池市', '南宁市'), ('来宾市', '南宁市'), ('崇左市', '南宁市')],
	[('南宁市', '柳州市'), ('柳州市', '柳州市'), ('桂林市', '柳州市'), ('梧州市', '柳州市'), ('北海市', '柳州市'), ('防城港市', '柳州市'), ('钦州市', '柳州市'),
	 ('贵港市', '柳州市'), ('玉林市', '柳州市'), ('百色市', '柳州市'), ('贺州市', '柳州市'), ('河池市', '柳州市'), ('来宾市', '柳州市'), ('崇左市', '柳州市')],
	[('南宁市', '桂林市'), ('柳州市', '桂林市'), ('桂林市', '桂林市'), ('梧州市', '桂林市'), ('北海市', '桂林市'), ('防城港市', '桂林市'), ('钦州市', '桂林市'),
	 ('贵港市', '桂林市'), ('玉林市', '桂林市'), ('百色市', '桂林市'), ('贺州市', '桂林市'), ('河池市', '桂林市'), ('来宾市', '桂林市'), ('崇左市', '桂林市')],
	[('南宁市', '梧州市'), ('柳州市', '梧州市'), ('桂林市', '梧州市'), ('梧州市', '梧州市'), ('北海市', '梧州市'), ('防城港市', '梧州市'), ('钦州市', '梧州市'),
	 ('贵港市', '梧州市'), ('玉林市', '梧州市'), ('百色市', '梧州市'), ('贺州市', '梧州市'), ('河池市', '梧州市'), ('来宾市', '梧州市'), ('崇左市', '梧州市')],
	[('南宁市', '北海市'), ('柳州市', '北海市'), ('桂林市', '北海市'), ('梧州市', '北海市'), ('北海市', '北海市'), ('防城港市', '北海市'), ('钦州市', '北海市'),
	 ('贵港市', '北海市'), ('玉林市', '北海市'), ('百色市', '北海市'), ('贺州市', '北海市'), ('河池市', '北海市'), ('来宾市', '北海市'), ('崇左市', '北海市')],
	[('南宁市', '防城港市'), ('柳州市', '防城港市'), ('桂林市', '防城港市'), ('梧州市', '防城港市'), ('北海市', '防城港市'), ('防城港市', '防城港市'),
	 ('钦州市', '防城港市'), ('贵港市', '防城港市'), ('玉林市', '防城港市'), ('百色市', '防城港市'), ('贺州市', '防城港市'), ('河池市', '防城港市'),
	 ('来宾市', '防城港市'), ('崇左市', '防城港市')],
	[('南宁市', '钦州市'), ('柳州市', '钦州市'), ('桂林市', '钦州市'), ('梧州市', '钦州市'), ('北海市', '钦州市'), ('防城港市', '钦州市'), ('钦州市', '钦州市'),
	 ('贵港市', '钦州市'), ('玉林市', '钦州市'), ('百色市', '钦州市'), ('贺州市', '钦州市'), ('河池市', '钦州市'), ('来宾市', '钦州市'), ('崇左市', '钦州市')],
	[('南宁市', '贵港市'), ('柳州市', '贵港市'), ('桂林市', '贵港市'), ('梧州市', '贵港市'), ('北海市', '贵港市'), ('防城港市', '贵港市'), ('钦州市', '贵港市'),
	 ('贵港市', '贵港市'), ('玉林市', '贵港市'), ('百色市', '贵港市'), ('贺州市', '贵港市'), ('河池市', '贵港市'), ('来宾市', '贵港市'), ('崇左市', '贵港市')],
	[('南宁市', '玉林市'), ('柳州市', '玉林市'), ('桂林市', '玉林市'), ('梧州市', '玉林市'), ('北海市', '玉林市'), ('防城港市', '玉林市'), ('钦州市', '玉林市'),
	 ('贵港市', '玉林市'), ('玉林市', '玉林市'), ('百色市', '玉林市'), ('贺州市', '玉林市'), ('河池市', '玉林市'), ('来宾市', '玉林市'), ('崇左市', '玉林市')],
	[('南宁市', '百色市'), ('柳州市', '百色市'), ('桂林市', '百色市'), ('梧州市', '百色市'), ('北海市', '百色市'), ('防城港市', '百色市'), ('钦州市', '百色市'),
	 ('贵港市', '百色市'), ('玉林市', '百色市'), ('百色市', '百色市'), ('贺州市', '百色市'), ('河池市', '百色市'), ('来宾市', '百色市'), ('崇左市', '百色市')],
	[('南宁市', '贺州市'), ('柳州市', '贺州市'), ('桂林市', '贺州市'), ('梧州市', '贺州市'), ('北海市', '贺州市'), ('防城港市', '贺州市'), ('钦州市', '贺州市'),
	 ('贵港市', '贺州市'), ('玉林市', '贺州市'), ('百色市', '贺州市'), ('贺州市', '贺州市'), ('河池市', '贺州市'), ('来宾市', '贺州市'), ('崇左市', '贺州市')],
	[('南宁市', '河池市'), ('柳州市', '河池市'), ('桂林市', '河池市'), ('梧州市', '河池市'), ('北海市', '河池市'), ('防城港市', '河池市'), ('钦州市', '河池市'),
	 ('贵港市', '河池市'), ('玉林市', '河池市'), ('百色市', '河池市'), ('贺州市', '河池市'), ('河池市', '河池市'), ('来宾市', '河池市'), ('崇左市', '河池市')],
	[('南宁市', '来宾市'), ('柳州市', '来宾市'), ('桂林市', '来宾市'), ('梧州市', '来宾市'), ('北海市', '来宾市'), ('防城港市', '来宾市'), ('钦州市', '来宾市'),
	 ('贵港市', '来宾市'), ('玉林市', '来宾市'), ('百色市', '来宾市'), ('贺州市', '来宾市'), ('河池市', '来宾市'), ('来宾市', '来宾市'), ('崇左市', '来宾市')],
	[('南宁市', '崇左市'), ('柳州市', '崇左市'), ('桂林市', '崇左市'), ('梧州市', '崇左市'), ('北海市', '崇左市'), ('防城港市', '崇左市'), ('钦州市', '崇左市'),
	 ('贵港市', '崇左市'), ('玉林市', '崇左市'), ('百色市', '崇左市'), ('贺州市', '崇左市'), ('河池市', '崇左市'), ('来宾市', '崇左市'), ('崇左市', '崇左市')]]
print(len(list))
city_od_list_pro = []
for i in range(14):
	for j in range(14):
		city_od_list_pro.append(list[i][j])
print(city_od_list_pro)